<a href="https://colab.research.google.com/github/adudars/PedidON/blob/master/arquivos/9.1_ConsultasSimplesTabelas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 9.1 CONSULTAS DAS TABELAS COM TODOS OS DADOS INSERIDOS

## ESTABELECENDO CONEXÃO

### Instalando bibliotecas de acesso

In [1]:
#!pip install --user psycopg2-binary
#!pip install --user pandas

### Importando bibliotecas

In [3]:
import pandas as pd
import psycopg2

### Conectando com o banco através do psycopg2

In [4]:
conn = psycopg2.connect(host="lallah.db.elephantsql.com",database="nxthbnlu", user="nxthbnlu", password="buyAYKsY17pqexg1grIcJaWm0gHBsO2F")

## SELECT SIMPLES DAS TABELAS

### Tabela cliente

In [5]:
cliente = pd.read_sql_query("select * from cliente", conn)

In [6]:
cliente

   id_cliente nome_cliente  cpf_cliente
0           1         Lara        10582
1           2        Jorge        11736
2           3        Clara        12890
3           4         Davi        14045
4           5       Milton        15199
5           6        Luiza        18662
6           7          Ana        16354
7           8         Tais        17508
8           9     Isabella        19817
9          10     Henrique        22010

### Tabela funcionário

In [7]:
funcionario = pd.read_sql_query("select * from funcionario", conn)

In [8]:
funcionario

   id_funcionario nome_funcionario  matricula_funcionario
0               1         Bernardo                2210921
1               2          Matheus                3874638
2               3           Ismael                4733307

### Tabela comanda

In [9]:
comanda = pd.read_sql_query("select * from comanda", conn)

In [10]:
comanda

    id_comanda  mesa        data  fk_id_cliente  fk_id_funcionario
0            1    13  2020-07-30              1                  1
1            2     1  2020-07-30              2                  1
2            3     4  2020-07-30              3                  2
3            4    12  2020-07-30              4                  3
4            5     3  2020-07-30              5                  2
5            6     1  2020-07-31              2                  3
6            7    13  2020-07-31              6                  1
7            8     2  2020-07-31              7                  2
8            9    12  2020-07-31              8                  3
9           10     4  2020-08-01              4                  1
10          11    13  2020-08-01              2                  2
11          12    12  2020-08-01              9                  3
12          13    13  2020-08-01             10                  2

### Tabela pedido

In [11]:
pedido = pd.read_sql_query("select * from pedido", conn)

In [12]:
pedido

    id_pedido  quantidade      hora  fk_id_comanda  fk_id_itemcardapio
0           1           2  12:58:00              1                   1
1           2           1  13:19:00              1                   2
2           3           1  12:34:00              2                   3
3           4           3  12:45:00              3                   4
4           5           1  12:45:00              3                   5
5           6           2  13:30:00              3                   6
6           7           1  12:23:00              4                   7
7           8           1  12:37:00              4                   8
8           9           2  13:42:00              5                   9
9          10           1  12:26:00              6                  10
10         11           1  12:57:00              6                   1
11         12           2  12:21:00              7                   2
12         13           3  13:15:00              8                   3
13         14           3  13:38:00              8                   4
14         15           1  13:02:00              9                   5
15         16           2  13:04:00             10                   6
16         17           3  13:37:00             10                   7
17         18           1  13:49:00             10                   8
18         19           1  12:18:00             11                   9
19         20           1  12:43:00             12                   1
20         21           2  13:09:00             12                   2
21         22           3  13:38:00             13                   3
22         23           4  13:51:00             13                   4
23         24           2  14:23:00             13                   5
24         25           1  14:29:00             13                   6

### Tabela item cardápio

In [13]:
cardapio = pd.read_sql_query("select * from item_cardapio", conn)

In [14]:
cardapio

   id_itemcardapio              nome_item  ...  fk_id_categoria fk_id_tamanho
0                1          Reta da Penha  ...                1             2
1                2               Rua Sete  ...                1             2
2                3         Parque Moscoso  ...                3             1
3                4      Convento da Penha  ...                3             1
4                5           Ilha de Socó  ...                4             2
5                6  Bons ventos te trazem  ...                2             2
6                7             Barlavento  ...                2             2
7                8          Stella Artois  ...                2             4
8                9                  Pepsi  ...                2             5
9               10             Cidade Sol  ...                2             2

[10 rows x 6 columns]

### Tabela observação

In [15]:
obs = pd.read_sql_query("select * from observacao", conn)

In [16]:
obs

   id_obs                    descricao  fk_id_pedido
0       1                      Sem sal             1
1       2      Um prato e talher extra             4
2       3                    Sem nozes             5
3       4                   Sem espuma             7
4       5  Dois copos com gelo e limão             9
5       6          Sem os pães da casa            12
6       7                 Sem maracujá            10
7       8               Servir no copo             8
8       9        Porção extra de arroz            14
9      10            Adicionar pimenta            11

### Tabela categoria

In [17]:
categoria = pd.read_sql_query("select * from categoria", conn)

In [18]:
categoria

   id_categoria nome_categoria
0             1        entrada
1             2          drink
2             3      principal
3             4      sobremesa

### Tabela tamanho

In [19]:
tamanho = pd.read_sql_query("select * from tamanho", conn)

In [20]:
tamanho

   id_tamanho  descricao
0           1  2 pessoas
1           2   1 pessoa
2           3   infantil
3           4  long neck
4           5       lata